[
  {
    "title": "Legends",
    "content": "Legends have always fascinated me, from little neighborhood rumors to the bigger ones that seem to change from town to town. And honestly, some of the scariest ones I ever heard didn’t come from books or movies... they came straight from other kids.\n\nI still remember, about ten years ago, one of the kids from my neighborhood told me this story. We were probably twelve, sitting out late with flashlights, daring each other to go deeper into the woods... and he swore every word of it was true.\n\nSee, our neighborhood backs right up to the woods. And tucked back in there, halfway down a slope, there’s this old trailer. Not shiny or new... even back then it was beat up, tan beige, the paint flaking, rust around the edges... like something out of the eighties that hadn’t moved in years.\n\nNow, the way he told it, that trailer belonged to this older man, maybe fifty or sixty. Supposedly he lived out there because he didn’t like people. Kept to himself, didn’t bother anyone. But... and here’s the part that made us all sit up... my friend swore he had actually talked to him. Said the man wasn’t mean, just kind of strange, like he didn’t want you too close.\n\nBut at night, it was different. My friend said when the sun went down, the man would leave the trailer and wander... and if you happened to be out there, unlucky enough to run into him, he’d pull out this big kitchen knife... kill you... and drag you back into the woods. Nobody ever found the bodies. That’s what he swore.\n\nHe told me after a while, the man just stopped showing up. No one knew if he left... or if he was still hiding in those woods. And of course, when I was a kid, I couldn’t resist. I remember going out there with friends, creeping up to that trailer. We never saw him. We never found anything. But every time... it felt like something was watching us.\n\nAnd the trailer’s still there... just sitting... tan, rusted, quiet. You look at it, and you can’t help but think about that story... and wonder if maybe... just maybe... there was some truth to it."
  },
  {
    "title": "Scary Stories in the Dark",
    "content": "One thing I remember fondly about my childhood was the time spent huddled under a tree late at night telling scary stories. There are a few that really stuck out to me when I was young, and I still tell them to this day. It’s never quite the same reading them as it is hearing them told, since you lose some of the atmosphere, some of the pacing, but I’ll try my best.\n\nSo there was this boy who lived with his parents and his dog. Every night, the dog slept under his bed, and whenever he got scared, he’d stick his hand down and the dog would lick it, and that would calm him down.\n\nOne weekend his parents went away to a conference, left him all alone in the house.\n\nThat night, around ten o’clock, he’d just fallen asleep when he woke up to this sound: \"drip… drip… drip…\"\n\nScared, he reached down, felt the dog lick his hand, and went back to sleep.\n\nA little while later, he woke up again. \"Drip… drip… drip…\" Scared again, reached down, dog licked his hand, back to sleep.\n\nAnd again, later that night: \"drip… drip… drip…\" He reached down, felt the lick, calmed down—but this time, he was curious. So he got up, followed the sound down the hall to the bathroom.\n\nWhen he opened the door, he saw a little puddle on the floor. He looked up to find the leak—only to see his dog, stapled to the ceiling.\n\nTerrified, he ran back to bed, hid under the covers, and somehow fell asleep.\n\nIn the morning, he rushed back to the bathroom—but it was spotless. Nothing on the floor, no dog on the ceiling. He thought, it must’ve just been a nightmare.\n\nSo he went downstairs, thinking about breakfast, when he suddenly felt someone breathing on the back of his neck… and a voice whispered in his ear:\n\n\"Humans can lick too.\"\n\nThere’s another one I remember.\n\nThere’s this babysitter, right? And she’s watching this kid who will not stop asking for ice cream. \"I want ice cream! I want ice cream!\"\n\nSo she says, \"Fine, where is it?\" and the kid goes, \"In the basement.\"\n\nSo she goes down, and at the bottom of the stairs she sees this glass case, with a mannequin inside, wearing a full hockey uniform. It’s weird, but she ignores it, grabs the ice cream, goes upstairs, and serves the kid.\n\nThen he starts whining again: \"I want sprinkles! I want sprinkles!\"\n\nShe sighs, asks where they are, and of course he says: \"In the basement.\"\n\nSo back down she goes. And while she’s reaching for the sprinkles, out of the corner of her eye she notices something, on the hockey mask. Looks like jam smeared across the front. She thinks it’s strange, but brushes it off, heads back up, and gives him his sprinkles.\n\nAnd sure enough, he starts up again: \"I want a cherry! I want a cherry!\"\n\nFrustrated, she asks where, and he says it again: \"In the basement.\"\n\nSo she heads back down. But this time, when she looks—the mannequin is gone. A little freaked out, she grabs the cherries, hurries upstairs.\n\nThe boy isn’t in the living room anymore. She figures maybe he’s in the bathroom, so she walks into the kitchen to finish up. She goes to put the cherry on top of the bowl… and sees it’s not ice cream in there at all.\n\nIt’s the boy’s head.\n\nShe panics, calls the police. Later, she’s telling the boy’s mother about how she saw this weird mannequin in the basement.\n\nAnd the mother looks at her and says:\n\n\"We don’t have mannequins. We have mirrors.\""
  }
]
