[
  {
    "title": "Legends",
    "content": "Legends have always fascinated me, from little neighborhood rumors to the bigger ones that seem to change from town to town. And honestly, some of the scariest ones I ever heard didn’t come from books or movies... they came straight from other kids.\n\nI still remember, about ten years ago, one of the kids from my neighborhood told me this story. We were probably twelve, sitting out late with flashlights, daring each other to go deeper into the woods... and he swore every word of it was true.\n\nSee, our neighborhood backs right up to the woods. And tucked back in there, halfway down a slope, there’s this old trailer. Not shiny or new... even back then it was beat up, tan beige, the paint flaking, rust around the edges... like something out of the eighties that hadn’t moved in years.\n\nNow, the way he told it, that trailer belonged to this older man, maybe fifty or sixty. Supposedly he lived out there because he didn’t like people. Kept to himself, didn’t bother anyone. But... and here’s the part that made us all sit up... my friend swore he had actually talked to him. Said the man wasn’t mean, just kind of strange, like he didn’t want you too close.\n\nBut at night, it was different. My friend said when the sun went down, the man would leave the trailer and wander... and if you happened to be out there, unlucky enough to run into him, he’d pull out this big kitchen knife... kill you... and drag you back into the woods. Nobody ever found the bodies. That’s what he swore.\n\nHe told me after a while, the man just stopped showing up. No one knew if he left... or if he was still hiding in those woods. And of course, when I was a kid, I couldn’t resist. I remember going out there with friends, creeping up to that trailer. We never saw him. We never found anything. But every time... it felt like something was watching us.\n\nAnd the trailer’s still there... just sitting... tan, rusted, quiet. You look at it, and you can’t help but think about that story... and wonder if maybe... just maybe... there was some truth to it."
  },
  {
    "title": "Scary Stories in the Dark",
    "content": "One thing I remember fodly about my childhood, was the time spent huddled under a tree late at night telling scary stories. There are a few that really stook out to me when I was young and I still tell them to this day. It is no where near as good reading these stories as it is hearing them being told, as I feel it loses some of the atmosphere and nuance of the stories, loses some of the pacing, but I'll try my best.\n\n\tThere was this boy who lived with his parents and his dog. His dog would always sleep under the boys bed and when the boy was scared, he'd stick his hnd under the bed and the dog would lick it, calming the boys nerves. His parents had just left for a conference and would be gone for the whole weekend, leaving the boy alone for a couple days. It was about 10:00pm and boy had just went to bed when he was woken up by a \"drip... drip... drip...\". That scared the boy so he stuck his hand under the bed, his dog licked him, and he went back to sleep.\nA little while later he was woken up again by another, \"drip... drip... drip...\". Again, this scared the boy so he stuck his hand under the bed, his do licked it, and he went back to sleep.\nAgain, a little while later, he is woken up by \"drip... drip... drip... \". The boy is scared, so he puts his hand under the bed, his dog licks hims, and his nerves are calmed. But the boy is curius, so he decides to get out of bed and walks down the hallway to the bathroom when the dripping can be heard. He opens the door and can see a small puddle on the floor. He looks up at the ceiling to see where the leak is coming from, when he sees his dog, stapled to the ceiling. Terrified, he runs back to bed, hides under the covers, and falls back to sleep.\nIn the morning he wakes back up, and rushes to the bathroom. When he gets there it looks like nothing happened, so he figures, it must have been a nightmare. He heds downstairs to get some cereal when he feels breathing on his neck, and hears someone whisper into his ear, \"Humans can lick too\".\n\n\tThere's this babysitter, and she's looking after this kid. And he is really insitent on having icecream. \"I want icecream! I want icecream!\" So she's like \"fine, but where is it?\" and he answers with, \"in the basement\". So she walks down the stairs and at the bottom she see a glass case with a mannequin wearing a hockey uniform. She thinks its odd but she ignores it and grabs the icecream from the freezer, goes unpstairs, and serves him his icecream.\nBut then he starts whining, \"I want sprinkles! I want sprinkles!\" So she's like \"fine, where are they?\" and again the kid says, \"in the basement\". So she goes back downstairs, and when she is going to grab the sprinkles, she notices out the corner of her eye that it apears that there's jam on the hockey mask. She thinks it's odd but she ignores it and heads back upstaris.\nShe gives him his sprinkles, and again he starts whining, \"I want a cherry! I want a cherry\". An again she goes, \"fine, where are they?\" and again the kid says, \"in the basement\". So she heads back downstairs and notices that the mannequin is missing. A little  confused, she continues and grabs the cherries and makes her way back upstairs. When she gets there, the kid is gone. She thinks that he's just gone to the bathroom and continues to the kitchen. When she goes to add the cherry, she notices, that it's not icecream in the bowl, but the kid's head. Terrified, she calls the police. A little while later, she's alking to the mother and she notes on how their weird mannequin has gone missing, and the mother looks at her, confused, and says, \"We dont have mannequins, we have mirrors.\""
  }
]
